class About extends React.Component {
    constructor(props){
        super(props);
    }
    render(){
        return(
            <div>
                <h3 className="font-italic">Про журнал</h3>
                <p>Журнал публікує оригінальні матеріали, присвячені дослідженню
                    актуальних питань навчання української та іноземних мов учнів середньої
                    школи та студентів вищих закладів освіти, включаючи історію
                    лінгводидактичних досліджень, теоретичні засади навчання мов, практичні
                    розробки та методичні рекомендації з окресленої проблематики.</p>
                <p>У журналі можуть публікувати результати своїх досліджень викладачі,
                    аспіранти, студенти магістратури.</p>
                <p>Формат журналу відповідає міжнародним стандартам. Всі статті
                    проходять процедуру рецензування. Тези доповідей англійською,
                    українською та російською мовами відображають основний зміст наукових
                    досліджень. Списки довідників копіюються латинським алфавітом для
                    індексації в міжнародних базах даних абстрактних і цитаткових.</p>
                <p>Головний редактор: завідувач кафедри методики викладання української
                    та іноземних мов і літератур Інституту філології, доктор педагогічних наук,
                    професор В’ячеслав Шовковий.</p>
                <p>Редакційна колегія з актуальних питань навчання української та
                    іноземних мов охоплює видатних українських та зарубіжних учених у галузі
                    лінгводидактики.</p>
                <p>Примірники журналу надсилаються до бібліотек, які входять до
                    обов’язкового списку розсилки наукових видань, затвердженого МОН
                    України, та провідних університетів, які забезпечують професійну вищу
                    освіту в галузі підготовки філологів та вчителів української та іноземних мов.</p>
                <p>Всі права зарезервовані. При цитуванні слід згадати автора статті та
                    Журналу. Перепечатки або репродукції у будь-якій формі можливі лише за
                    попереднім дозволом видавця.</p>
            </div>
        );
    }
}
(function() {
    ReactDOM.render(<About />, document.getElementById('about'));
})();